; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	infrared1 - mode
	infrared3 - mode
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	Star0 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared1)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(supports instrument3 infrared1)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(have_image Planet4 thermograph2)
	(have_image Planet5 spectrograph0)
	(have_image Star6 thermograph2)
	(have_image Star7 infrared3)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 infrared1)
	(have_image Star10 infrared3)
))

(:metric minimize (total-time))
)

; plan
1. (switch-on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (turn-to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn-to satellite1 planet4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet4)
   goals met: 0 of 7
5. (take-image satellite1 planet4 instrument2 thermograph2)
   added: (have_image planet4 thermograph2)
   goals met: 1 of 7
6. (turn-to satellite1 star6 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star6)
   goals met: 1 of 7
7. (take-image satellite1 star6 instrument2 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 2 of 7
8. (switch-on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
9. (turn-to satellite0 star1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star1)
   goals met: 2 of 7
10. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 2 of 7
11. (turn-to satellite0 planet5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet5)
   goals met: 2 of 7
12. (take-image satellite0 planet5 instrument0 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 3 of 7
13. (turn-to satellite0 phenomenon8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 7
14. (take-image satellite0 phenomenon8 instrument0 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 7
15. (turn-to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 4 of 7
16. (take-image satellite1 star9 instrument2 infrared1)
   added: (have_image star9 infrared1)
   goals met: 5 of 7
17. (turn-to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 5 of 7
18. (take-image satellite1 star7 instrument2 infrared3)
   added: (have_image star7 infrared3)
   goals met: 6 of 7
19. (turn-to satellite1 star10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star10)
   goals met: 6 of 7
20. (take-image satellite1 star10 instrument2 infrared3)
   added: (have_image star10 infrared3)
   goals met: 7 of 7
